// Task 1
// Создайте функцию, которая принимает массив с неограниченным количеством данных,
// и возвращает количество строк, переданных ей в этом массиве.
// Решить с использованием стрелочных функций

// Answer Task 1

// const strings = ["Mara", "Barsyk", "Mursyk", "Fred", "Garfield" ];
// const numberOfStrings = (...strings) => strings.length;
// console.log(strings.length);

// ***********************

// Task 2

// Создайте функцию продвинутого калькулятора.Он принимает знак,
// а  затем неограниченное количество чисел,
// над которыми проведет указанную операцию.

// Answer Task 3

// ***********************

// Task 3

// Имея массив чисел, найдите в нем самое большое.
// Не используйте циклы или методы перебора массива.

// Answer Task 3

// var num = [2, 15, 11, 13];
// console.log(Math.max.apply(null, num));

// ***********************
